In [1]:
# The usual libraries

import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
# Establish database connection

from sqlalchemy import create_engine

db_name = 'dog_names'
db_password = 'database123!'
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/{db_name}"
engine = create_engine(db_string)

In [3]:
# Import sql table as pandas dataframe.

pet_names = pd.read_sql("select * from pet_names", engine)

### Cleaning

In [4]:
pet_names.dtypes

animal_name              object
animal_gender            object
animal_birth_year         int64
breed_name               object
zipcode                 float64
license_issue_date       object
license_expired_date     object
extract_year              int64
dtype: object

In [5]:
pet_names1 = pet_names.copy()

In [6]:
pet_names1 = pet_names1.dropna()

In [7]:
pet_names1['license_issue_date'] = pd.to_datetime(pet_names['license_issue_date'])
pet_names1['license_expired_date'] = pd.to_datetime(pet_names['license_expired_date'])

In [8]:
pet_names1.dtypes

animal_name                     object
animal_gender                   object
animal_birth_year                int64
breed_name                      object
zipcode                        float64
license_issue_date      datetime64[ns]
license_expired_date    datetime64[ns]
extract_year                     int64
dtype: object

In [9]:
pet_names1.zipcode = pet_names1.zipcode.astype(int)
pet_names1.zipcode = pet_names1.zipcode.astype(str)

In [10]:
pet_names1.dtypes

animal_name                     object
animal_gender                   object
animal_birth_year                int64
breed_name                      object
zipcode                         object
license_issue_date      datetime64[ns]
license_expired_date    datetime64[ns]
extract_year                     int64
dtype: object

In [11]:
pet_names1.count()

animal_name             489412
animal_gender           489412
animal_birth_year       489412
breed_name              489412
zipcode                 489412
license_issue_date      489412
license_expired_date    489412
extract_year            489412
dtype: int64

### Count by zipcode

In [12]:
zip_data = pet_names1[['animal_name', 'zipcode']].copy()

In [13]:
zip_data

       animal_name zipcode
0            PAIGE   10035
1             YOGI   10465
2              ALI   10013
3            QUEEN   10013
4             LOLA   10028
...            ...     ...
489476           A   11203
489477      DEXTER   10009
489478      PRINCE   11221
489479      FINBAR   10023
489480       BELLA   10465

[489412 rows x 2 columns]

In [14]:
zip_data.zipcode = zip_data.zipcode.astype(str).copy()
zip_data

       animal_name zipcode
0            PAIGE   10035
1             YOGI   10465
2              ALI   10013
3            QUEEN   10013
4             LOLA   10028
...            ...     ...
489476           A   11203
489477      DEXTER   10009
489478      PRINCE   11221
489479      FINBAR   10023
489480       BELLA   10465

[489412 rows x 2 columns]

In [15]:
zip_data.dtypes

animal_name    object
zipcode        object
dtype: object

In [16]:
zip_data = zip_data[zip_data['zipcode'].apply(len)==5]

In [17]:
tab_zip_data = zip_data.groupby('zipcode').size()
tab_zip_data

zipcode
10001    3558
10002    4520
10003    5606
10004     568
10005    1285
         ...
98072       2
98363       4
98433       1
99202       1
99508       1
Length: 630, dtype: int64